//=============================================
//
// ボスの攻撃状態管理処理 [bossattackstate.cpp ]
// Author: Asuma Nishio
//
//=============================================

//**************************
// インクルードファイル宣言
//**************************
#include "state.h"
#include "bossattackstate.h"

//====================================
// オーバーロードコンストラクタ
//====================================
CBosshandAttack::CBosshandAttack()
{
	// IDセット
	SetID(ID_ACTION);
}
//====================================
// オーバーロードデストラクタ
//====================================
CBosshandAttack::~CBosshandAttack()
{
	// 無い
}
//====================================
// 開始処理
//====================================
void CBosshandAttack::OnStart(void)
{

}
//====================================
// 更新処理
//====================================
void CBosshandAttack::OnUpdate(void)
{

}
//====================================
// 終了処理
//====================================
void CBosshandAttack::OnExit(void)
{

}
