//=====================================
//
// 敵の状態管理処理 [ enemystate.cpp ]
// Author: Asuma Nishio
//
//=====================================

//**********************
// インクルードファイル
//**********************
#include "enemystate.h"

//==================================
// 敵状態基底クラスコンストラクタ
//==================================
CEnemyStateBase::CEnemyStateBase()
{
	// 値のクリア
	m_ID = ID_NONE;
	m_pEnemy = nullptr;
}
//==================================
// 敵状態基底クラスデストラクタ
//==================================
CEnemyStateBase::~CEnemyStateBase()
{
	// 無し
}

//==================================
// 落下状態コンストラクタ
//==================================
CEnemyStateFall::CEnemyStateFall()
{
	// IDをセットする
	SetID(ID_FALL);
}
//==================================
// 落下状態デストラクタ
//==================================
CEnemyStateFall::~CEnemyStateFall()
{
	// 無し
}
//==================================
// 落下状態開始関数
//==================================
void CEnemyStateFall::OnStart()
{

}
//==================================
// 落下状態更新関数
//==================================
void CEnemyStateFall::OnUpdate()
{

}
//==================================
// 落下状態終了関数
//==================================
void CEnemyStateFall::OnExit()
{

}


//==================================
// 移動状態時コンストラクタ
//==================================
CEnemyStateMove::CEnemyStateMove()
{
	// IDをセットする
	SetID(ID_MOVE);
}
//==================================
// 移動状態時デストラクタ
//==================================
CEnemyStateMove::~CEnemyStateMove()
{
	// 無し
}
//==================================
// 移動状態開始関数
//==================================
void CEnemyStateMove::OnStart()
{
	// 無し
}
//==================================
// 移動状態更新関数
//==================================
void CEnemyStateMove::OnUpdate()
{
	// 移動処理

}
//==================================
// 移動状態終了関数
//==================================
void CEnemyStateMove::OnExit()
{

}

